app/controllers/gists_controller.rb

UPDATE "gists" SET "snippet" = ?, "updated_at" = ? WHERE "gists"."id" = 2  [["snippet", "int n = 131231;"], ["updated_at", Fri, 07 Mar 2014 16:36:09 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @gist.update(gist_params)

DELETE FROM "gists" WHERE "gists"."id" = ?  [["id", 1]]
---
  def destroy
    @gist.destroy